from aiohttp import web
import socketio
import openllm
import difflib


sio = socketio.AsyncServer(async_mode='aiohttp', cors_allowed_origins="*")
app = web.Application()
sio.attach(app)

llm = openllm.LLM('ugshanyu/mongol-mistral-3')

def most_similar(input_str, string_list):
    # Calculate similarity scores for each string in the list
    similarity_scores = [difflib.SequenceMatcher(None, input_str, s).ratio() for s in string_list]
    
    # Find the index of the string with the highest similarity score
    max_index = similarity_scores.index(max(similarity_scores))
    
    # Return the most similar string and its similarity score
    return string_list[max_index], similarity_scores[max_index]



info_dict = {
    "Хан-Уул": """ <s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: "Хан-Уул Дүүрэг нь Монгол улсын нийслэл Улаанбаатар хотын 9 дүүргийн нэг юм. 16 хороонд хуваагддаг. 2022 оны байдлаар хүн амын тоо  238,511. Одоогийн засаг дарга Ж.Алдаржавхлан.
Үе үеийн Хотын засаг даргуудын шийдвэр гаргаж Хан-Уул дүүрэгт газар олгосон байдал Сумъяабазар 1639 (хамгийн их), Энхболд 1097,Мөнхбаяр 467, Бат-Үүл 336, Батболд 296, Амарсайхан 242, Билэгт 82, Батбаяр 82, Батбаясгалан 28 (хамгийн бага) удаа шийдвэр гаргаж Хан-Уул дүүрэгт газар олгосон байна.

Онд шийдвэр гаргасан огноо 2019 онд 72 хамгийн бага ширхэг, 2020 онд 748 хамгийн их ширхэг, 2021 онд 190 ширхэг, 2022 онд 608 ширхэг, 2023 онд 291 ширхэг Хан-Уул дүүрэгт газар олгогдсон байна.

Хан-Уул дүүргийн хамгийн том газар эзэмшигч нь "Нийслэлийн Өмчит Улаанбаатар хөрөнгө оруулалт менежемент ХХК" бөгөөд Үндэсний төв цэнгэлдэх хүрээлэн байгуулах зориулалтаар 14.920.000 м2  хэмжээтэй газартай. Уг газарыг олгосон Засаг дарга нь  Батбаясгалан юм.
    Асуулт: """,


"Сумъяабазар": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: "Сумъяабазар нь 2020-2023 он хүртэл 4н жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээн нийт 2871 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газарыг Эмээлт эко аж үйлдвэрийн паркд "Үйлдвэрлэлийн технологийн парк" чиглэлрээр 2,355,124 м2 хэмжээтэй газар олгосон.
    Сумъяабазар нь хамгийн их шийдвэрийг 2021 онд 1190 удаа гаргаж газар олгосон байна. 2020 онд 568 удаа, 2022 онд 677 удаа, 2023 онд 436 удаа тус тус шийдвэр гаргаж газар олгосон байна.
    Дүүргүүдэд газар олгосон газарын тоо
        1) Хан-Уул дүүрэгт хамгийн их буюу 1639 удаа шийдвэр гаргаж газар олгосон байна,
        2) Чингэлтэй дүүрэгт 88,
        3) Сонгинхайрхан дүүрэгт 417
        4) Баянзүрх дүүрэгт 322
        5) Баянгол дүүрэгт 179
        6) Сүхбаатар дүүрэгт 143
        7) Налайх дүүрэгт 42
        8) Багахангай дүүрэгт 24
        9) Багануур дүүрэгт 16 буюу хамгийн бага удаа газар олгосон байна.

    Асуулт: """,

"Мөнхбаяр": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Мөнхбаяр нь 2009-2012 он хүртэл 4н жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 1679 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Арц алтан тэвш ХХК -д "Орон сууц, Амины орон сууцны хотхон" чиглэлээр 1,500,000 м2 хэмжээтэйгээр олгосон.
        Мөнхбаяр нь хамгийн их шийдвэрийг 2010 онд 568 удаа гаргаж газар олгосон байна. 2009 онд 353, 2011 онд 435, хамгийн бага шийдвэрийг 2012 онд 323 шийдвэр гаргаж газар олгосон байна.
        Дүүргүүдэд газар олгосон газрын тоо
        Хан-Уул дүүрэгт 467 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
        Чингэлтэй дүүрэгт 87,
        Сонгинохайрхан дүүрэгт 212
        Баянзүрх дүүрэгт 441
        Баянгол дүүрэгт 274
        Сүхбаатар дүүрэгт 190
        Налайх дүүрэгт 6
        Багахангай дүүрэгт 1
        Багануур дүүрэгт 1 буюу хамгийн бага тоогоор газар олгосон байна.

        Асуулт: """,

"Батбаясгалан": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Жанцангийн Батбаясгалан нь 2020 онд 1 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 66 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Нийслэлийн өмчит Улаанбаатар хөрөнгө оруулалт, менежмент ХХК-д "Үндэсний төв цэнгэлдэх хүрээлэн байгуулах" зориулалтаар 14,920,000 м2 хэмжээтэй газар олгосон.
    Ажилласан хугацаандаа 2020 онд 66 (хамгийн их) шийдвэр гаргаж газар олгосон байна. 
    Дүүргүүдэд газар олгосон газрын тоо Хан-Уул дүүрэгт 28 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна, Чингэлтэй дүүрэгт 3 буюу хамгийн бага тоогоор газар олгосон байна. Сонгинохайрхан дүүрэгт 16, Баянзүрх дүүрэгт 13, Сүхбаатар дүүрэгт 6 тус тус шийдвэр гаргаж газар олгосон байна.    
    Асуулт: """,

"Энхболд": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Миеэгомбын Энхболд нь 2000-2005 он хүртэл 6н жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 7,374 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Монгол экспорт ХХК -д "Амины орон сууцны барилга" зориулалтаар 18,000,000 м2 хэмжээтэй газар олгосон.
        Ажилласан хугацаандаа 
        2000 онд 698, 
        2001 онд 1179, 
        2002 онд 1561, 
        2003 онд 1295, 
        хамгийн их газарыг 2004 онд 2048 удаа, 
        хамгийн бага газарыг 2005 онд 593 шийдвэр гаргаж газар олгосон байна.
        Дүүргүүдэд газар олгосон газрын тоо
        Хан-Уул дүүрэгт 1,097 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
        Чингэлтэй дүүрэгт 692,
        Сонгинохайрхан дүүрэгт 903
        Баянзүрх дүүрэгт 1,684
        Баянгол дүүрэгт 1,822
        Сүхбаатар дүүрэгт 1,114
        Налайх дүүрэгт 58
        Багахангай дүүрэгт 1
        Багануур дүүрэгт 1 буюу хамгийн бага тоогоор газар олгосон байна.
        Асуулт: """,
"Амарсайхан": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Амарсайхан нь 2019-2020 он хүртэл 2 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 919 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Налайхын барилгын материалын үйлдвэрлэл. Технологийн парк ОНӨААТҮГ -д "Үйлдвэрлэл технологийн паркын үйлдвэрлэл" зориулалтаар 1,300,000 м2 хэмжээтэй газар олгосон.
        Ажилласан хугацаандаа 2019 онд 378, 2020 онд 541 шийдвэр гаргаж газар олгосон байна.
        
        Хан-Уул дүүрэгт 242 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
        Чингэлтэй дүүрэгт 86,
        Сонгинохайрхан дүүрэгт 143,
        Баянзүрх дүүрэгт 188,
        Баянгол дүүрэгт 119,
        Сүхбаатар дүүрэгт 96,
        Налайх дүүрэгт 26,
        Багануур дүүрэгт 10
        Багахангай дүүрэгт 9 буюу хамгийн бага тоогоор газар олгосон байна.
        
        Асуулт: """,
"Батболд": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Сундуйн Батболд нь 2016-2018 он хүртэл 3 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 1,381 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Монгол наадам цогцолбор ОНӨТҮГ -д "Монгол наадам цогцолборыг бүтээх байгуулах" зориулалтаар 5,510,000 м2 хэмжээтэй газар олгосон.
    Ажилласан хугацаандаа 2016 онд 13, 2017 онд 480, 2018 онд 888 шийдвэр гаргаж газар олгосон байна.
    Дүүргүүдэд газар олгосон газрын тоо,
    Хан-Уул дүүрэгт 296 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
    Чингэлтэй дүүрэгт 99,
    Сонгинохайрхан дүүрэгт 286,
    Баянзүрх дүүрэгт 313,
    Баянгол дүүрэгт 158,
    Сүхбаатар дүүрэгт 171,
    Налайх дүүрэгт 97,
    Багануур дүүрэгт 14,
    Багахангай дүүрэгт 7 буюу хамгийн бага тоогоор газар олгосон байна.

    Асуулт: """,

"Билэгт": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Түдэвийн Билэгт нь 2007-2008 он хүртэл 2 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 516 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Туушин ХХК -д "Олон улсын ачаа тээвэр терминал" зориулалтаар 1,300,000 м2 хэмжээтэй газар олгосон.
    Ажилласан хугацаандаа 2007 онд 79, 2008 онд 437 шийдвэр гаргаж газар олгосон байна.
    Дүүргүүдэд газар олгосон газрын тоо
    Чингэлтэй дүүрэгт 49 буюу хамгийн бага тоогоор газар олгосон байна.
    Хан-Уул дүүрэгт 82,
    Сонгинохайрхан дүүрэгт 107,
    Баянгол дүүрэгт 105,
    Сүхбаатар дүүрэгт 64, 
    Баянзүрх дүүрэгт 109 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,

    Асуулт: """,
"Батбаяр": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Цогтын Батбаяр нь 2006-2007 он хүртэл 2 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 485 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Харилцаа холбооны зохицуулах газар -д "Радио дохио хянах төв" зориулалтаар 239,300 м2 хэмжээтэй газар олгосон.
    Ажилласан хугацаандаа 2006 онд 313, 2007 онд 172 шийдвэр гаргаж газар олгосон байна.
    Дүүргүүдэд газар олгосон газрын тоо
    Хан-Уул дүүрэгт 82 
    Чингэлтэй дүүрэгт 52 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
    Сонгинохайрхан дүүрэгт 98
    Баянзүрх дүүрэгт 93
    Баянгол дүүрэгт 99 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна,
    Сүхбаатар дүүрэгт 61

    Асуулт: """,
"Бат-Үүл": """<s>[INST] Нийтлэлийг уншаад асуултан хариул. Хэрэв нийтлэлд багтаагүй асуулт асуувал мэдэхгүй гэж хариул. Хүний талаар сайн муу гэж дүгнэлт гаргаж болохгүй
    Нийтлэл: Эрдэнийн Бат-Үүл нь 2012-2016 он хүртэл 5 жил Улаанбаатар хотын засаг даргаар ажиллаж байсан. Тэрээр нийт 1,888 удаа шийдвэр гаргаж газар олгож байсан. Тэрээр хамгийн том хэмжээтэй газрыг Иргэн Ц.Алтандуулга -д "Цэцэрлэгт хүрээлэн" зориулалтаар 9,600,000 м2 хэмжээтэй газар олгосон.
    Ажилласан хугацаандаа 2012 онд 1, 2013 онд 262, 2014 онд 554, 2015 онд 633,  2016 онд 438 шийдвэр гаргаж газар олгосон байна.
    Дүүргүүдэд газар олгосон газрын тоо
    Хан-Уул дүүрэгт 336 
    Чингэлтэй дүүрэгт 82
    Сонгинохайрхан дүүрэгт 406 буюу хамгийн их тоогоор шийдвэр гаргаж газар олгосон байна
    Баянзүрх дүүрэгт 495
    Баянгол дүүрэгт 313
    Сүхбаатар дүүрэгт 175
    Налайх дүүрэгт 35
    Багахангай дүүрэгт 10 буюу хамгийн бага тоогоор газар олгосон байна.
    Багануур дүүрэгт 34
    Асуулт: """,
}

string_list = list(info_dict.keys())


@sio.event
async def connect(sid, environ):
    print('User connected:', sid)

@sio.event
async def disconnect(sid):
    print('User disconnected:', sid)

@sio.event
async def my_event(sid, message):
    print("User said: " + message['data'])
    print("User id: " + message['id'])

    prompt = ""
    
    if(message['id'] == "Usion"):
        prompt = "<s>[INST]" + message['data'] + "[/INST]"
    
    elif(message['id'] == "transparent"):
        input_string = message['data']
        most_similar_string, score = most_similar(input_string, string_list)
        prompt = info_dict[most_similar_string] + input_string + " [/INST]"
        print(f"The most similar string to '{input_string}' is '{most_similar_string}' with a similarity score of {score:.2f}")


    async for generation in llm.generate_iterator(
        prompt,
        max_new_tokens=512,
        temperature=0.5,
        top_p=0.95
    ):
        await sio.emit('my_response', {'data': generation.outputs[0].text}, room=sid)
    await sio.emit('my_response', {'data': "<end>"}, room=sid)

@sio.event
async def all(sid, message):
    print("User said: " + message['data'])
    generated_parts = []
    async for generation in llm.generate_iterator(
        message['data'],
        max_new_tokens=512,
        temperature=0.5,
        top_p=0.95
    ):
        generated_parts.append(generation.outputs[0].text)
    full_generated_text = ''.join(generated_parts)
    await sio.emit('my_response', {'data': full_generated_text}, room=sid)

if __name__ == '__main__':
    web.run_app(app, port=8080)
